grafana-prometheus-loki-promtail/artillery/stress.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"

    - duration: 120
      arrivalRate: 20
      rampTo: 200
      name: "Ramp up load"

    - duration: 60
      arrivalRate: 300
      name: "Sustain high load"

scenarios:
  - name: "Stress endpoints"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200